Revit 2027 API
Document.NewAreaTag Method
Creates a new area tag.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaTag NewAreaTag(
	ViewPlan areaView,
	Area room,
	UV point
)
Public Function NewAreaTag (
	areaView As ViewPlan,
	room As Area,
	point As UV
) As AreaTag
public:
AreaTag^ NewAreaTag(
	ViewPlan^ areaView,
	Area^ room,
	UV^ point
)
member NewAreaTag :
        areaView : ViewPlan *
        room : Area *
        point : UV -> AreaTag
Parameters
areaView ViewPlan
The area view
room Area
The area to tag
point UV
The position of the area tag
Return Value
AreaTag
Exceptions
Exception | Condition
ArgumentException | Thrown if the area view does not exist in the given document.
ArgumentException | Thrown if the area does not exist in the given document.
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace